{
  "results": [
    {
      "id": "934632",
      "original_language": "en",
      "overview": "The rebels gear up for battle against the ruthless forces of the Motherworld as unbreakable bonds are forged, heroes emerge — and legends are made.",
      "poster_path": "/cxevDYdeFkiixRShbObdwAHBZry.jpg",
      "release_date": "2024-04-19",
      "title": "Rebel Moon — Part Two: The Scargiver",
      "vote_average": 6.11
    },
    {
      "id": "1096197",
      "original_language": "en",
      "overview": "Characters from different backgrounds are thrown together when the plane they're travelling on crashes into the Pacific Ocean. A nightmare fight for survival ensues with the air supply running out and dangers creeping in from all sides.",
      "poster_path": "/9YTdswepVeqnZYo2Mkdn3mKNraF.jpg",
      "release_date": "2024-01-18",
      "title": "No Way Up",
      "vote_average": 6.391
    },
    {
      "id": "823464",
      "original_language": "en",
      "overview": "Following their explosive showdown, Godzilla and Kong must reunite against a colossal undiscovered threat hidden within our world, challenging their very existence – and our own.",
      "poster_path": "/tMefBSflR6PGQLv7WvFPpKLZkyk.jpg",
      "release_date": "2024-03-27",
      "title": "Godzilla x Kong: The New Empire",
      "vote_average": 6.615
    },
    {
      "id": "1011985",
      "original_language": "en",
      "overview": "Po is gearing up to become the spiritual leader of his Valley of Peace, but also needs someone to take his place as Dragon Warrior. As such, he will train a new kung fu practitioner for the spot and will encounter a villain called the Chameleon who conjures villains from the past.",
      "poster_path": "/kDp1vUBnMpe8ak4rjgl3cLELqjU.jpg",
      "release_date": "2024-03-02",
      "title": "Kung Fu Panda 4",
      "vote_average": 7.16
    },
    {
      "id": "693134",
      "original_language": "en",
      "overview": "Follow the mythic journey of Paul Atreides as he unites with Chani and the Fremen while on a path of revenge against the conspirators who destroyed his family. Facing a choice between the love of his life and the fate of the known universe, Paul endeavors to prevent a terrible future only he can foresee.",
      "poster_path": "/1pdfLvkbY9ohJlCjQH2CZjjYVvJ.jpg",
      "release_date": "2024-02-27",
      "title": "Dune: Part Two",
      "vote_average": 8.265
    },
    {
      "id": "1041613",
      "original_language": "en",
      "overview": "An American nun embarks on a new journey when she joins a remote convent in the Italian countryside. However, her warm welcome quickly turns into a living nightmare when she discovers her new home harbours a sinister secret and unspeakable horrors.",
      "poster_path": "/fdZpvODTX5wwkD0ikZNaClE4AoW.jpg",
      "release_date": "2024-03-20",
      "title": "Immaculate",
      "vote_average": 6.2
    },
    {
      "id": "845111",
      "original_language": "fr",
      "overview": "D'Artagnan, on a quest to rescue the abducted Constance, runs into the mysterious Milady de Winter again. The tension between the Catholics and the Protestants finally escalates, as the king declares war — forcing the now four musketeers into battle. But as the war goes on, they are tested physically, mentally and emotionally.",
      "poster_path": "/rtosxP5sXuoRFPH4sVbMccLIPiV.jpg",
      "release_date": "2023-12-13",
      "title": "The Three Musketeers: Milady",
      "vote_average": 6.514
    },
    {
      "id": "1105407",
      "original_language": "en",
      "overview": "A Chicago detective travels to Scotland after an emerging serial killer’s crimes match those that he investigated five years earlier, one of which was the crime scene of his murdered girlfriend.",
      "poster_path": "/tMO0YLXgJZBnIAjoTSz26zE33YN.jpg",
      "release_date": "2024-04-12",
      "title": "Damaged",
      "vote_average": 4.713
    },
    {
      "id": "976906",
      "original_language": "en",
      "overview": "August 1944. With the American Eighth Air Force poised to strike over Nazi Germany, British Intelligence learns that they could be flying into a deadly trap. With only hours to spare, Flight Lieutenant Edward Barnes must fly a life and death mission over Berlin in his unarmed Spitfire to obtain photographic evidence and save the lives of 1200 men.",
      "poster_path": "/xtPPOPTad1qopK6uDe3VlYUa22o.jpg",
      "release_date": "2022-05-13",
      "title": "Spitfire Over Berlin",
      "vote_average": 3.4
    },
    {
      "id": "784651",
      "original_language": "hi",
      "overview": "Top IAF aviators come together in the face of imminent danger, to form Air Dragons. Fighter unfolds their camaraderie, brotherhood and battles, internal and external.",
      "poster_path": "/zDZowwb9GZGEctAu2PCpjiPQAMM.jpg",
      "release_date": "2024-01-24",
      "title": "Fighter",
      "vote_average": 5.125
    },
    {
      "id": "634492",
      "original_language": "en",
      "overview": "Forced to confront revelations about her past, paramedic Cassandra Webb forges a relationship with three young women destined for powerful futures...if they can all survive a deadly present.",
      "poster_path": "/rULWuutDcN5NvtiZi4FRPzRYWSh.jpg",
      "release_date": "2024-02-14",
      "title": "Madame Web",
      "vote_average": 5.61
    },
    {
      "id": "618588",
      "original_language": "en",
      "overview": "Over the course of ten days and 435 miles, an unbreakable bond is forged between pro adventure racer Michael Light and a scrappy street dog companion dubbed Arthur. As the team is pushed to their outer limits of endurance in the race, Arthur redefines what victory, loyalty and friendship truly mean.",
      "poster_path": "/gxVcBc4VM0kAg9wX4HVg6KJHG46.jpg",
      "release_date": "2024-03-15",
      "title": "Arthur the King",
      "vote_average": 6.7
    },
    {
      "id": "601796",
      "original_language": "ko",
      "overview": "Gurus in the late Goryeo dynasty try to obtain a fabled, holy sword, and humans in 2022 hunt down an alien prisoner that is locked in a human's body. The two parties cross paths when a time-traveling portal opens up.",
      "poster_path": "/8QVDXDiOGHRcAD4oM6MXjE0osSj.jpg",
      "release_date": "2022-07-20",
      "title": "Alienoid",
      "vote_average": 6.8
    },
    {
      "id": "359410",
      "original_language": "en",
      "overview": "Ex-UFC fighter Dalton takes a job as a bouncer at a Florida Keys roadhouse, only to discover that this paradise is not all it seems.",
      "poster_path": "/bXi6IQiQDHD00JFio5ZSZOeRSBh.jpg",
      "release_date": "2024-03-08",
      "title": "Road House",
      "vote_average": 7.029
    },
    {
      "id": "940551",
      "original_language": "en",
      "overview": "After a migrating duck family alights on their pond with thrilling tales of far-flung places, the Mallard family embarks on a family road trip, from New England, to New York City, to tropical Jamaica.",
      "poster_path": "/ldfCF9RhR40mppkzmftxapaHeTo.jpg",
      "release_date": "2023-12-06",
      "title": "Migration",
      "vote_average": 7.521
    },
    {
      "id": "938614",
      "original_language": "en",
      "overview": "A live broadcast of a late-night talk show in 1977 goes horribly wrong, unleashing evil into the nation's living rooms.",
      "poster_path": "/u3YQJctMzFN2wAvnkmXy41bXhFv.jpg",
      "release_date": "2024-03-19",
      "title": "Late Night with the Devil",
      "vote_average": 7.303
    },
    {
      "id": "720321",
      "original_language": "en",
      "overview": "Air-supply is scarce in the near future, forcing a mother and daughter to fight for survival when two strangers arrive desperate for an oxygenated haven.",
      "poster_path": "/gPAW0a24TrkafrJQ1axEv0I3jov.jpg",
      "release_date": "2024-04-04",
      "title": "Breathe",
      "vote_average": 5.088
    },
    {
      "id": "1239146",
      "original_language": "en",
      "overview": "After getting kicked out of the forest, Woody thinks he's found a forever home at Camp Woo Hoo — until an inspector threatens to shut down the camp.",
      "poster_path": "/mMnzNYvpqLLLdgF5TMmXfuy6wzx.jpg",
      "release_date": "2024-04-12",
      "title": "Woody Woodpecker Goes to Camp",
      "vote_average": 6.788
    },
    {
      "id": "929590",
      "original_language": "en",
      "overview": "In the near future, a group of war journalists attempt to survive while reporting the truth as the United States stands on the brink of civil war.",
      "poster_path": "/sh7Rg8Er3tFcN9BpKIPOMvALgZd.jpg",
      "release_date": "2024-04-10",
      "title": "Civil War",
      "vote_average": 7.437
    },
    {
      "id": "7451",
      "original_language": "en",
      "overview": "Xander Cage is your standard adrenaline junkie with no fear and a lousy attitude. When the US Government \"recruits\" him to go on a mission, he's not exactly thrilled. His mission: to gather information on an organization that may just be planning the destruction of the world, led by the nihilistic Yorgi.",
      "poster_path": "/xeEw3eLeSFmJgXZzmF2Efww0q3s.jpg",
      "release_date": "2002-08-09",
      "title": "xXx",
      "vote_average": 5.931
    }
  ],
  "favorites": [],
  "users": [
    {
      "id": "6ddbccf5-8840-4dc1-b3c5-ce74395c27a8",
      "name": "Mera Fahmy",
      "email": "mera21@gmail.com",
      "password": "12345678",
      "age": "22"
    }
  ]
}